app/signals/apps/sigmax/templates/sigmax/voegZaakdocumentToe_Lk01.xml

{% comment %}Make sure to XML escape the inputs here (are user supplied!) {% endcomment %}
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
   <soap:Body>
      <ZKN:edcLk01 xmlns:ZKN="http://www.egem.nl/StUF/sector/zkn/0310" xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:gml="http://www.opengis.net/gml" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:mime="http://www.w3.org/2005/05/xmlmime">
         <ZKN:stuurgegevens>
            <StUF:berichtcode>Lk01</StUF:berichtcode>
            <StUF:zender>
               <StUF:organisatie>AMS</StUF:organisatie>
               <StUF:applicatie>SIA</StUF:applicatie>
            </StUF:zender>
            <StUF:ontvanger>
               <StUF:organisatie>SMX</StUF:organisatie>
               <StUF:applicatie>CTC</StUF:applicatie>
            </StUF:ontvanger>
            <StUF:referentienummer>1234567890</StUF:referentienummer>
            <StUF:tijdstipBericht>20180517132910</StUF:tijdstipBericht>
            <StUF:entiteittype>EDC</StUF:entiteittype>
         </ZKN:stuurgegevens>
         <ZKN:parameters>
            <StUF:mutatiesoort>T</StUF:mutatiesoort>
            <StUF:indicatorOvername>V</StUF:indicatorOvername>
         </ZKN:parameters>
         <ZKN:object StUF:entiteittype="EDC" StUF:sleutelVerzendend="2356402" StUF:sleutelOntvangend="" StUF:sleutelGegevensbeheer="2356402" StUF:verwerkingssoort="T">
            <ZKN:identificatie>{{ DOC_UUID }}</ZKN:identificatie>
            <ZKN:dct.omschrijving>Foto</ZKN:dct.omschrijving>
            <ZKN:creatiedatum>20170520</ZKN:creatiedatum>
            <ZKN:ontvangstdatum StUF:noValue="geenWaarde" xsi:nil="true"/>
            <ZKN:titel>Onderwerp</ZKN:titel>
            <ZKN:beschrijving StUF:noValue="geenWaarde" xsi:nil="true"/>
            <ZKN:formaat>{{ DOC_TYPE|safe }}</ZKN:formaat>
            <ZKN:taal>NL</ZKN:taal>
            <ZKN:versie StUF:noValue="geenWaarde" xsi:nil="true"/>
            <ZKN:status>Definitief</ZKN:status>
            <ZKN:verzenddatum StUF:noValue="geenWaarde" xsi:nil="true"/>
            <ZKN:vertrouwelijkAanduiding>VERTROUWELIJK</ZKN:vertrouwelijkAanduiding>
            <ZKN:auteur>Tester</ZKN:auteur>
            <ZKN:inhoud mime:contentType="{{ DOC_TYPE|lower }}" StUF:bestandsnaam="{{ FILE_NAME|safe }}">{{ DATA }}</ZKN:inhoud>
            <ZKN:isRelevantVoor StUF:entiteittype="EDCZAK" StUF:verwerkingssoort="T">
               <ZKN:gerelateerde StUF:entiteittype="ZAK" StUF:sleutelVerzendend="2356401" StUF:sleutelOntvangend="" StUF:sleutelGegevensbeheer="2356401" StUF:verwerkingssoort="T">
                  {% if sequence_number %}
                  <ZKN:identificatie>{{ signal.sia_id }}.{{ sequence_number }}</ZKN:identificatie>
                  {% else %}
                  <ZKN:identificatie>{{ signal.sia_id }}</ZKN:identificatie>
                  {% endif %}

                  <ZKN:omschrijving>Onderwerp</ZKN:omschrijving>
                  <ZKN:isVan StUF:entiteittype="ZAKZKT" StUF:verwerkingssoort="T">
                     <ZKN:gerelateerde StUF:entiteittype="ZKT" StUF:verwerkingssoort="T">
                        <ZKN:omschrijving>Fietshandhaving Centrum</ZKN:omschrijving>
                        <ZKN:code>2</ZKN:code>
                        <ZKN:ingangsdatumObject StUF:noValue="geenWaarde" xsi:nil="true"/>
                     </ZKN:gerelateerde>
                  </ZKN:isVan>
               </ZKN:gerelateerde>
            </ZKN:isRelevantVoor>
         </ZKN:object>
      </ZKN:edcLk01>
   </soap:Body>
</soap:Envelope>
